de/verbs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-04 Sun 21:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>German Verbs</title>
<meta name="author" content="[[file:../index.html][Vaibhav Karve]]" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">German Verbs
<br />
<span class="subtitle"><a href="index.html">Home</a></span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbfab94f">1. In emacs</a></li>
<li><a href="#orgdbc4ac3">2. German has only 1 present tense</a></li>
<li><a href="#orgdb7b978">3. Present tense</a>
<ul>
<li><a href="#org88b9362">3.1. Usually</a></li>
<li><a href="#org21bbba9">3.2. To be = <i>sein</i> (irregular verb)</a></li>
<li><a href="#org805d06a">3.3. To have = <i>haben</i> (irregular verb)</a></li>
<li><a href="#orgbe0db6e">3.4. Regular verb examples</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgbfab94f" class="outline-2">
<h2 id="orgbfab94f"><span class="section-number-2">1.</span> In emacs</h2>
<div class="outline-text-2" id="text-1">
<p>
to input German, use
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(set-input-method "german-postfix")
</pre>
</div>
<p>
Results in the following key sequences:
</p>
<p class="verse">
ae  → ä<br />
aee → ae<br />
oe  → ö<br />
oee → oe<br />
ue  → ü (not after a/e/q)<br />
uee → ue<br />
sz  → ß<br />
szz → sz<br />
E= → €<br />
</p>
</div>
</div>


<div id="outline-container-orgdbc4ac3" class="outline-2">
<h2 id="orgdbc4ac3"><span class="section-number-2">2.</span> German has only 1 present tense</h2>
<div class="outline-text-2" id="text-2">
<p>
<i>ich sage</i> is equivalent to all 3 of these English forms &#x2013;
</p>
<ul class="org-ul">
<li>I say</li>
<li>I am saying</li>
<li>I do say</li>
</ul>
</div>
</div>

<div id="outline-container-orgdb7b978" class="outline-2">
<h2 id="orgdb7b978"><span class="section-number-2">3.</span> Present tense</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org88b9362" class="outline-3">
<h3 id="org88b9362"><span class="section-number-3">3.1.</span> Usually</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Drop the <b>-en</b> or <b>-n</b> from the infinitive (root verb)</li>
<li>Then add the personal endings <b>-e</b>, <b>-(e)st</b>, <b>(e)t</b>, <b>–en</b>, <b>-(e)t</b>, <b>–en</b>) to the
remaining infinitive stem.</li>
</ul>
</div>
</div>

<div id="outline-container-org21bbba9" class="outline-3">
<h3 id="org21bbba9"><span class="section-number-3">3.2.</span> To be = <i>sein</i> (irregular verb)</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The verb <i>sein</i>'s table is irregular. Commonly used, so just memorize it.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Person</th>
<th scope="col" class="org-left">English (Singular)</th>
<th scope="col" class="org-left">English (Plural)</th>
<th scope="col" class="org-left">German (Singular)</th>
<th scope="col" class="org-left">German (Plural)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1st person</td>
<td class="org-left">I am</td>
<td class="org-left">We are</td>
<td class="org-left"><i>ich bin</i></td>
<td class="org-left"><i>wir sind</i></td>
</tr>

<tr>
<td class="org-left">2nd person</td>
<td class="org-left">You are</td>
<td class="org-left">You are</td>
<td class="org-left"><i>du bist</i></td>
<td class="org-left"><i>ihr seid</i></td>
</tr>

<tr>
<td class="org-left">3rd person</td>
<td class="org-left">He/She/It is</td>
<td class="org-left">They are</td>
<td class="org-left"><i>er/sie/es ist</i></td>
<td class="org-left"><i>sie sind</i></td>
</tr>

<tr>
<td class="org-left">3rd person &amp; Polite</td>
<td class="org-left">He/She/It is</td>
<td class="org-left">They are</td>
<td class="org-left"><i>Sie sind</i></td>
<td class="org-left"><i>Sie sind</i></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org805d06a" class="outline-3">
<h3 id="org805d06a"><span class="section-number-3">3.3.</span> To have = <i>haben</i> (irregular verb)</h3>
<div class="outline-text-3" id="text-3-3">
<p>
This verb is also irregular. Commonly used, so just memorize it.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Person</th>
<th scope="col" class="org-left">English (Singular)</th>
<th scope="col" class="org-left">English (Plural)</th>
<th scope="col" class="org-left">German (Singular)</th>
<th scope="col" class="org-left">German (Plural)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1st person</td>
<td class="org-left">I have</td>
<td class="org-left">We have</td>
<td class="org-left"><i>ich habe</i></td>
<td class="org-left"><i>wir haben</i></td>
</tr>

<tr>
<td class="org-left">2nd person</td>
<td class="org-left">You have</td>
<td class="org-left">You have</td>
<td class="org-left"><i>du hast</i></td>
<td class="org-left"><i>ihr habt</i></td>
</tr>

<tr>
<td class="org-left">3rd person</td>
<td class="org-left">He/She/It have</td>
<td class="org-left">They have</td>
<td class="org-left"><i>er/sie/es hat</i></td>
<td class="org-left"><i>sie haben</i></td>
</tr>

<tr>
<td class="org-left">3rd person &amp; Polite</td>
<td class="org-left">He/She/It have</td>
<td class="org-left">They have</td>
<td class="org-left"><i>Sie haben</i></td>
<td class="org-left"><i>Sie haben</i></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgbe0db6e" class="outline-3">
<h3 id="orgbe0db6e"><span class="section-number-3">3.4.</span> Regular verb examples</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Below are verb tables for regular verbs. Each table is very similar, with
only slight differences due to last letter of root verb.
</p>
</div>

<div id="outline-container-orga40f244" class="outline-4">
<h4 id="orga40f244"><span class="section-number-4">3.4.1.</span> <i>gehen</i> = to go</h4>
<div class="outline-text-4" id="text-3-4-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Person</th>
<th scope="col" class="org-left">Eng (Sing.)</th>
<th scope="col" class="org-left">Eng (Plu.)</th>
<th scope="col" class="org-left">German (Sing.)</th>
<th scope="col" class="org-left">German (Plu.)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1st</td>
<td class="org-left">I &#x2026;</td>
<td class="org-left">We &#x2026;</td>
<td class="org-left"><i>ich gehe</i></td>
<td class="org-left"><i>wir gehen</i></td>
</tr>

<tr>
<td class="org-left">2nd</td>
<td class="org-left">You &#x2026;</td>
<td class="org-left">You &#x2026;</td>
<td class="org-left"><i>du gehst</i></td>
<td class="org-left"><i>ihr geht</i></td>
</tr>

<tr>
<td class="org-left">3rd</td>
<td class="org-left">He/She/It &#x2026;</td>
<td class="org-left">They &#x2026;</td>
<td class="org-left"><i>er/sie/es geht</i></td>
<td class="org-left"><i>sie gehen</i></td>
</tr>

<tr>
<td class="org-left">3rd &amp; Polite</td>
<td class="org-left">He/She/It &#x2026;</td>
<td class="org-left">They &#x2026;</td>
<td class="org-left"><i>Sie gehen</i></td>
<td class="org-left"><i>Sie gehen</i></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgb2de600" class="outline-4">
<h4 id="orgb2de600"><span class="section-number-4">3.4.2.</span> <i>sitzen</i> = to sit</h4>
<div class="outline-text-4" id="text-3-4-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Person</th>
<th scope="col" class="org-left">Eng (Sing.)</th>
<th scope="col" class="org-left">Eng (Plu.)</th>
<th scope="col" class="org-left">German (Sing.)</th>
<th scope="col" class="org-left">German (Plu.)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1st</td>
<td class="org-left">I &#x2026;</td>
<td class="org-left">We &#x2026;</td>
<td class="org-left"><i>ich sitze</i></td>
<td class="org-left"><i>wir sitzen</i></td>
</tr>

<tr>
<td class="org-left">2nd</td>
<td class="org-left">You &#x2026;</td>
<td class="org-left">You &#x2026;</td>
<td class="org-left"><i>du sitzt*</i></td>
<td class="org-left"><i>ihr sitzt</i></td>
</tr>

<tr>
<td class="org-left">3rd</td>
<td class="org-left">He/She/It &#x2026;</td>
<td class="org-left">They &#x2026;</td>
<td class="org-left"><i>er/sie/es sitzt</i></td>
<td class="org-left"><i>sie sitzen</i></td>
</tr>

<tr>
<td class="org-left">3rd &amp; Polite</td>
<td class="org-left">He/She/It &#x2026;</td>
<td class="org-left">They &#x2026;</td>
<td class="org-left"><i>Sie sitzen</i></td>
<td class="org-left"><i>Sie sitzen</i></td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>= if the infinitive stem ends in <b>-s</b>, <b>-ß</b>, <b>-x</b>, or <b>-z</b>, then the <b>-s</b> in</li>
</ul>
<p>
<b>du</b>-ending is omitted.
</p>

<p>
Other exaples of this:
</p>
<ul class="org-ul">
<li><i>du faxt</i> = you are faxing (still? Really?)</li>
<li><i>du gießt</i> = you are pouring (🍺?)</li>
</ul>
</div>
</div>

<div id="outline-container-org7c1a3eb" class="outline-4">
<h4 id="org7c1a3eb"><span class="section-number-4">3.4.3.</span> <i>finden</i> = to find</h4>
<div class="outline-text-4" id="text-3-4-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Person</th>
<th scope="col" class="org-left">Eng (Sing.)</th>
<th scope="col" class="org-left">Eng (Plu.)</th>
<th scope="col" class="org-left">German (Sing.)</th>
<th scope="col" class="org-left">German (Plu.)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1st</td>
<td class="org-left">I &#x2026;</td>
<td class="org-left">We &#x2026;</td>
<td class="org-left"><i>ich finde</i></td>
<td class="org-left"><i>wir finden</i></td>
</tr>

<tr>
<td class="org-left">2nd</td>
<td class="org-left">You &#x2026;</td>
<td class="org-left">You &#x2026;</td>
<td class="org-left"><i>du findest</i></td>
<td class="org-left"><i>ihr findet</i></td>
</tr>

<tr>
<td class="org-left">3rd</td>
<td class="org-left">He/She/It &#x2026;</td>
<td class="org-left">They &#x2026;</td>
<td class="org-left"><i>er/sie/es findet</i></td>
<td class="org-left"><i>sie finden</i></td>
</tr>

<tr>
<td class="org-left">3rd &amp; Polite</td>
<td class="org-left">He/She/It &#x2026;</td>
<td class="org-left">They &#x2026;</td>
<td class="org-left"><i>Sie finden</i></td>
<td class="org-left"><i>Sie finden</i></td>
</tr>
</tbody>
</table>

<p>
A bunch of extra "e"s are inserted in the table above since the verb ends
in <i>d/t</i>, making the words easier to pronounce.
</p>

<p>
Other examples of this:
</p>
<ul class="org-ul">
<li><i>du arbeitest</i> = you work</li>
<li><i>er arbeitet</i> = he works</li>
<li><i>ihr arbeitet</i> = you (all) work</li>
<li><i>du öffnest</i> = you open</li>
<li><i>er öffnet</i> = he opens</li>
<li><i>ihr öffnet</i> = you (all) open</li>
</ul>
</div>
</div>

<div id="outline-container-orge25ffa8" class="outline-4">
<h4 id="orge25ffa8"><span class="section-number-4">3.4.4.</span> <i>handeln</i> = to act</h4>
<div class="outline-text-4" id="text-3-4-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Person</th>
<th scope="col" class="org-left">Eng (Sing.)</th>
<th scope="col" class="org-left">Eng (Plu.)</th>
<th scope="col" class="org-left">German (Sing.)</th>
<th scope="col" class="org-left">German (Plu.)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1st</td>
<td class="org-left">I &#x2026;</td>
<td class="org-left">We &#x2026;</td>
<td class="org-left"><i>ich handele</i></td>
<td class="org-left"><i>wir handeln*</i></td>
</tr>

<tr>
<td class="org-left">2nd</td>
<td class="org-left">You &#x2026;</td>
<td class="org-left">You &#x2026;</td>
<td class="org-left"><i>du handelst</i></td>
<td class="org-left"><i>ihr handelt</i></td>
</tr>

<tr>
<td class="org-left">3rd</td>
<td class="org-left">He/She/It &#x2026;</td>
<td class="org-left">They &#x2026;</td>
<td class="org-left"><i>er/sie/es handelt</i></td>
<td class="org-left"><i>sie handeln*</i></td>
</tr>

<tr>
<td class="org-left">3rd &amp; Polite</td>
<td class="org-left">He/She/It &#x2026;</td>
<td class="org-left">They &#x2026;</td>
<td class="org-left"><i>Sie handeln*</i></td>
<td class="org-left"><i>Sie handeln*</i></td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>= infinitive root ends in just <b>-n</b> instead of <b>-en</b>. Therefore, the
wir/sie/Sie forms end in <b>-n</b>.</li>
</ul>

<p>
Other examples of this:
</p>
<ul class="org-ul">
<li><i>wir ändern</i> = we change</li>
<li><i>Sie ändern</i> = they change</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: <a href="../index.html">Vaibhav Karve</a></p>
<p class="date">Created: 2024-02-04 Sun 21:01</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>